src/InformationRegisters/Scan_ПараметрыВидимостиОбъектов/Scan_ПараметрыВидимостиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ПараметрыВидимостиОбъектов</name>
  <comment>Регистр для хранения настроек видимости полей &quot;Соглашения о поставке&quot; и &quot;Специальные условия&quot;</comment>
  <resources>
    <name>Видимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Доступность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>РучноеИзменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСоглашенияОПоставке</name>
    <type>
      <types>EnumRef.Scan_ТипыСоглашенийОПоставке</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыЗаявокНаДействие</types>
      <types>CatalogRef.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий</types>
      <types>CatalogRef.Scan_СтатусыКалькуляций</types>
      <types>CatalogRef.Scan_СтатусыЗаявокНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.Scan_ХозяйственныеОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ПараметрыВидимостиОбъектов/Forms/ФормаЗаписи/Module.bsl
//Rarus bonmak 28.07.2022 18726 добавил области

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Запись.РучноеИзменение Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОбъектНастройки", Запись.ОбъектНастройки);
		Запрос.УстановитьПараметр("РольИсполнителя", Запись.РольИсполнителя);
		Запрос.УстановитьПараметр("ТипСоглашенияОПоставке", Запись.ТипСоглашенияОПоставке);
		Запрос.УстановитьПараметр("Статус", Запись.Статус);
		Запрос.УстановитьПараметр("ИмяЭлемента", Запись.ИмяЭлемента);
		Запрос.УстановитьПараметр("ХозОперация", Запись.ХозОперация);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	Scan_ПараметрыВидимостиОбъектов.Видимость КАК Видимость,
		|	Scan_ПараметрыВидимостиОбъектов.Доступность КАК Доступность,
		|	Scan_ПараметрыВидимостиОбъектов.РучноеИзменение КАК РучноеИзменение
		|ИЗ
		|	РегистрСведений.Scan_ПараметрыВидимостиОбъектов КАК Scan_ПараметрыВидимостиОбъектов
		|ГДЕ
		|	Scan_ПараметрыВидимостиОбъектов.ОбъектНастройки = &ОбъектНастройки
		|	И Scan_ПараметрыВидимостиОбъектов.РольИсполнителя = &РольИсполнителя
		|	И Scan_ПараметрыВидимостиОбъектов.ТипСоглашенияОПоставке = &ТипСоглашенияОПоставке
		|	И Scan_ПараметрыВидимостиОбъектов.Статус = &Статус
		|	И Scan_ПараметрыВидимостиОбъектов.ИмяЭлемента = &ИмяЭлемента
		|	И Scan_ПараметрыВидимостиОбъектов.ХозОперация = &ХозОперация";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			Запись.РучноеИзменение = Выборка.РучноеИзменение Или (Запись.Видимость <> Выборка.Видимость) Или (Запись.Доступность <> Выборка.Доступность);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
